In [1]:
import pandas as pd
from IPython.display import display

In [2]:
df = pd.read_csv(r"C:\Users\dimor\DATA SCIENCE PROJECTS\train.csv")
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [3]:
pd.set_option('display.max_rows', 235)
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category_1          550068 non-null  int64
 9   Product_Category_2          376430 non-null  float64
 10  Product_Category_3          166821 non-null  float64
 11  Purchase                    550068 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [5]:
#Rename columns for consistency + easier feature engineering/modelling


df = df.rename(columns = {
    'User_ID': 'user_id',
    'Product_ID': 'product_id',
    'Gender': 'gender',
    'Age': 'age_group',
    'Occupation': 'occupation',
    'City_Category': 'city_cat',
    'Stay_In_Current_City_Years': 'years_in_city',
    'Marital_Status': 'marital_status',
    'Product_Category_1': 'product_cat1',
    'Product_Category_2': 'product_cat2',
    'Product_Category_3': 'product_cat3',
    'Purchase': 'purchase_amt'
    
})
df

,user_id,product_id,gender,age_group,occupation,city_cat,years_in_city,marital_status,product_cat1,product_cat2,product_cat3,purchase_amt
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [6]:
df

,user_id,product_id,gender,age_group,occupation,city_cat,years_in_city,marital_status,product_cat1,product_cat2,product_cat3,purchase_amt
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [7]:
df.style.set_properties(**{'text-align': 'center'})
df

,user_id,product_id,gender,age_group,occupation,city_cat,years_in_city,marital_status,product_cat1,product_cat2,product_cat3,purchase_amt
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [8]:
df

,user_id,product_id,gender,age_group,occupation,city_cat,years_in_city,marital_status,product_cat1,product_cat2,product_cat3,purchase_amt
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [9]:
df.head(15)

,user_id,product_id,gender,age_group,occupation,city_cat,years_in_city,marital_status,product_cat1,product_cat2,product_cat3,purchase_amt
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
5,1000003,P00193542,M,26-35,15,A,3,0,1,2.0,NaN,15227
6,1000004,P00184942,M,46-50,7,B,2,1,1,8.0,17.0,19215
7,1000004,P00346142,M,46-50,7,B,2,1,1,15.0,NaN,15854
8,1000004,P0097242,M,46-50,7,B,2,1,1,16.0,NaN,15686
9,1000005,P00274942,M,26-35,20,A,1,1,8,NaN,NaN,7871
10,1000005,P00251242,M,26-35,20,A,1,1,5,11.0,NaN,5254
11,1000005,P00014542,M,26-35,20,A,1,1,8,NaN,NaN,3957
12,1000005,P00031342,M,26-35,20,A,1,1,8,NaN,NaN,6073
13,1000005,P00145042,M,26-35,20,A,1,1,1,2.0,5.0,15665
14,1000006,P00231342,F,51-55,9,A,1,0,5,8.0,14.0,5378

In [10]:
#Convert low-cardinality columns to 'category' dtype,
#Enables efficient groupby/pivot operations


cat_cols = [
    'gender',
    'age_group',
    'city_cat',
    'years_in_city',
    'marital_status',
    'occupation'
]

df[cat_cols] = df[cat_cols].astype('category')

In [11]:
df.duplicated().sum()

0

In [12]:
df[df.duplicated()].shape

(0, 12)

In [13]:
df

,user_id,product_id,gender,age_group,occupation,city_cat,years_in_city,marital_status,product_cat1,product_cat2,product_cat3,purchase_amt
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [14]:
# Fill product_cat2/3 NaNs with 'Unknown' 
# Reason: Dropping ~58% of 550k rows loses critical customer-product signals
# Alternative (mode imputation) would bias toward popular categories

df['product_cat2'] = df['product_cat2'].fillna('Unknown')
df['product_cat3'] = df['product_cat3'].fillna('Unknown')
df

,user_id,product_id,gender,age_group,occupation,city_cat,years_in_city,marital_status,product_cat1,product_cat2,product_cat3,purchase_amt
0,1000001,P00069042,F,0-17,10,A,2,0,3,Unknown,Unknown,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,Unknown,Unknown,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,Unknown,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,Unknown,Unknown,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,Unknown,Unknown,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,Unknown,Unknown,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,Unknown,Unknown,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,Unknown,Unknown,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,Unknown,Unknown,490

In [15]:
df

,user_id,product_id,gender,age_group,occupation,city_cat,years_in_city,marital_status,product_cat1,product_cat2,product_cat3,purchase_amt
0,1000001,P00069042,F,0-17,10,A,2,0,3,Unknown,Unknown,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,Unknown,Unknown,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,Unknown,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,Unknown,Unknown,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,Unknown,Unknown,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,Unknown,Unknown,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,Unknown,Unknown,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,Unknown,Unknown,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,Unknown,Unknown,490

In [16]:
# Check remaining nulls in product category columns after imputation
df[['product_cat1', 'product_cat2', 'product_cat3']].isna().sum()

product_cat1    0
product_cat2    0
product_cat3    0
dtype: int64

In [17]:
# Convert filled product_cat2/3 to 'category' dtype
df[['product_cat2', 'product_cat3']] = df[['product_cat2', 'product_cat3']].astype('category')
df.info() # Verify memory savings

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         550068 non-null  int64
 1   product_id      550068 non-null  object
 2   gender          550068 non-null  category
 3   age_group       550068 non-null  category
 4   occupation      550068 non-null  category
 5   city_cat        550068 non-null  category
 6   years_in_city   550068 non-null  category
 7   marital_status  550068 non-null  category
 8   product_cat1    550068 non-null  int64
 9   product_cat2    550068 non-null  category
 10  product_cat3    550068 non-null  category
 11  purchase_amt    550068 non-null  int64
dtypes: category(8), int64(3), object(1)
memory usage: 21.0+ MB